[
  {
    "id": 1,
    "topic": "Cognitive Behavioural Therapy (CBT)",
    "topic_data": "Over the last few decades, cognitive behavioural therapy (CBT) has become the most studied and widely used form of talk therapy.  In fact, most popular therapies such as DBT and mindfulness borrow elements from CBT.  The goal of CBT is to train the recipient to correct distorted beliefs, false thoughts, and impulsive behaviours.  Core to the practice of CBT is the Cognitive Model; which simply states that thoughts, emotions and behaviour are all interconnected and all three affect how we react to any given situation.  Although it may seem obvious the impact of this realization is quite profound, and there are decades of research that have proven that by changing one element of the model you can change the others.   In other words, if you can combat dysfunctional thoughts, you can change how you feel and behave.   If you change your behaviour it will change how you think and feel.   CBT starts by changing our thoughts as it is the area that we have the most control over.  This is accomplished by using exercises like thought records and cognitive conceptualization diagrams.  A thought record is a tool for combating a persistent negative thought by examining it and finding evidence to the contrary.  A cognitive conceptualization diagram is a tool for examining how one should react to a situation given one's strengths and life history and the different thoughts, behaviours and outcomes that may arise from the event.  A common theme in all CBT exercises is examining with evidence.  When we are depressed or anxious our thoughts and beliefs tend to be overly negative; we either underestimate our abilities and/or exaggerate potential dangers.   By actively examining the evidence most of the time you’ll find that the situation is not as bad as it appears and that you have the tools to adapt.   With practice, you will find that you have more balanced thoughts and eventually this will correct underlying dysfunctional beliefs.  CBT is not concerned with understanding the past, or how or why you formed those beliefs.  According to CBT, you don’t necessarily need that information to correct distorted thinking.  Having said that most CBT practitioners will spend some of their time examining a person's history and provide a sympathetic ear but it will not be the focus of the therapy.   If you are looking for a type of therapy with a focus on examining the past psychodynamic therapy is probably a better option, or you can do both at the same time.  Once you have made progress in changing negative beliefs and thinking patterns, CBT trains you to turn those positive changes into positive behaviours. Making positive changes in behaviours provides more evidence to fix distortions and the whole process is reinforced.   This reenforcement process is key to the success of CBT and the power of applying the cognitive model in your life. "
  },
  {
    "id": 2,
    "topic": "Acceptance and Commitment Therapy (ACT)",
    "topic_data": "Acceptance and commitment therapy (ACT) is a type of psychotherapy that emphasizes acceptance as a way to deal with negative thoughts, feelings, symptoms, or circumstances. It also encourages increased commitment to healthy, constructive activities that uphold your values or goals.  This approach carries a host of benefits, and it may help people stop habitually avoiding certain thoughts or emotional experiences, which can lead to further problems.  ACT therapists operate under a theory that suggests that increasing acceptance can lead to increased 'psychological flexibility' Psychological flexibility refers to a person's ability to adapt to situational demands with longer-term life goals and to commit to behaviours.  ACT aims to increase psychological flexibility through six core processes: acceptance, cognitive defusion (which is the process of examining your thoughts as an observer instead of passively accepting them), self as context, being present, values, and committed action.  Check out this source for more information on ACT https://contextualscience.org/act."
  },
  {
    "id": 3,
    "topic": "Biofeedback",
    "topic_data": "Biofeedback involves training clients to pay attention to normally involuntary physiological processes so they can learn to control them.  The mechanism behind biofeedback is based on the complex interplay between the mental and physical components of emotion.  When a person forms an emotion, a mental state creates a physical sensation.  What is less obvious is that sometimes the reverse is true.   Physical sensations can have powerful impacts on how we interpret an event.   Arousal, pain, temperature, breathing rate, blood pressure and other sensations all act together to alter how likely you are to perceive some event as threatening.   Often arousal is associated with perceived danger so by reducing physical arousal you can reduce your anxiety and stress levels.  Biofeedback is a very specific kind of training where you learn to control aspects of your physiology by actively monitoring these processes using medical devices.   Your brain then learns how to connect the mind with the process, and eventually, the mind can gain control.  With practice, some people are even able to reduce their blood pressure!"
  },
  {
    "id": 4,
    "topic": "Dialectical Behaviour Therapy (DBT)",
    "topic_data": "Dialectical Behaviour Therapy (DBT) blends cognitive-behavioural interventions (or CBT) with acceptance-based strategies derived from Buddhist meditative practices. While DBT was first developed to treat patients with borderline personality disorder, it is now also used to treat patients with eating disorders, addictions, anger problems, and other impulsive behaviours. This well-researched treatment has been shown to reduce suicidal and self-harm behaviours along with the frequency of hospitalizations. It also helps people remain engaged in therapy and decreases substance use."
  },
  {
    "id": 5,
    "topic": "Interpersonal Therapy (IPT)",
    "topic_data": "Interpersonal therapy (IPT), sometimes referred to as interpersonal psychotherapy, is a well-researched form of therapy that focuses on an individual’s recent life stressors and changes/conflicts in current relationships.  Interpersonal psychotherapy (IPT) was originally developed by Gerald Klerman and Myrna Weissman in the 1970s.  IPT is designed to help improve interpersonal relationships. Like cognitive behavioral therapy, IPT is time-limited and can be done individually or in groups. The goal is to help people to identify relationship problems and enhance social support and interpersonal skills. IPT addresses disputes, large transitions such as divorce or death, problem-solving, and attachment issues. In fact, IPT as theory is based on previous theories of attachment.  Insecure attachment early in life may lead to attachment issues and difficulty forming relationships throughout life.  Developmental psychologist John Bowlby originally described the concept of attachment as the bond between a baby and its mother. That original relationship acts as a template that forms the basis for that person's attachment style.  If the child has a healthy relationship with his caregiver, they are more likely to feel secure in their relationship later in life. An insecure attachment can lead to insecurity in future relationships, especially romantic relationships.  There are different variations and degrees of insecure attachments that are caused by different issues in that original relationship; so, attachment is not a simple binary option."
  },
  {
    "id": 6,
    "topic": "Marriage and Family Therapy",
    "topic_data": "Marriage and family therapy treats psychological problems within the context of a couple or family system. The focus is broadened from the individual to include primary relationships.  The family’s behaviour impacts the individual with the presenting problem and therefore, may need to be included in the treatment.  Additionally, mental illness affects not only those with mental health problems but also their friends and families.  Marriage and family counselling can benefit both the individual with the problem and their family or partner.  This type of counselling can help increase understanding, support, and teach specific skills for coping and communication.  It can also teach an individual skills to deepen family connections and get through stressful times.  It is important that the counsellor is culturally sensitive as culture has a large impact on family relationship roles.  Sometimes cultural expectations and boundaries can limit communication as people may feel that they are being disrespected.  In those situations, it is important that the counsellor is sensitive to everyone’s feelings and finds a way to facilitate positive communication. Research supports the use of marriage and family therapy for many issues, including relationship distress, anxiety, mood disorders and substance and alcohol abuse."
  },
  {
    "id": 7,
    "topic": "Psychodynamic Therapy",
    "topic_data": "Psychodynamic therapy is the original talking cure first invented by Sigmund Freud (based on psychoanalytic theory).  According to psychoanalytic theory, there are cognitions that are beyond our awareness that dictate our thoughts, feelings, and behaviors. He labeled where this happens your subconscious mind.  Much of what goes on below our awareness are intense negative and/or primitive emotions like anger, lust, and jealousy.  According to the theory most mental illness is caused by damage to the subconscious; usually in early childhood; sometimes even by one event.  Most therapies will recognize the importance of early childhood experience in the adult as a contributing factor.  In psychoanalytic theory mental illness is rooted in hidden traumas or dysfunctional family systems."
  },
  {
    "id": 8,
    "topic": "Eye Movement Desensitization and Reprocessing (EMDR)",
    "topic_data": "Eye movement desensitization and reprocessing (EMDR) is a therapy designed to treat the symptoms of post-traumatic stress disorder (PTSD). In EMDR sessions, an individual recalls a traumatic memory while paying attention to a specific motor task, such as moving one’s eyes side to side to follow the therapist’s waving finger.  EMDR is repeated until traumatic memory no longer evokes distress. The therapist and the individual then work on developing healthier beliefs regarding traumatic events. The mechanism of EMDR is unclear; however, research supports its efficacy with individuals suffering from PTSD."
  },
  {
    "id": 9,
    "topic": "Group Therapy",
    "topic_data": "Group therapy is a form of talk therapy in which a small, carefully selected group of individuals struggling with similar problems meets regularly under the guidance of a therapist. The purpose of group therapy is to assist each individual in emotional growth and personal problem-solving. Group therapy helps people learn about themselves and take steps toward meaningful change. It also allows individuals to learn from other group members. Often people find emotional support from other members of the group who are going through the same experiences.  Groups can be general or focus on a specific problem or disorder; or a group of people; such as groups for veterans, domestic abuse survivors, or sexual abuse survivors.  Groups can follow many different treatment approaches, including Cognitive Behavioural Therapy (CBT), Dialectical Behavioural Therapy (DBT), and Psychodynamic Therapy. Group therapy has been shown to be useful for people struggling with addictions, depression, and eating disorders, as well as those facing illness, such as HIV and cancer. There are generally two different styles of group therapy. Educational groups and groups that focus on emotional support. In an educational group, the therapist will lead in lessons with a clear topic and sharing personal stories may not be encouraged.  It is important to enquire about the focus before joining the group. If you don’t you may not find a particular group a good fit.  Group therapy is excellent in combination with one-on-one therapy as they complement each other's strengths.  One-on-one therapy provides individual attention to specific needs, and group therapy provides support from people who understand your issues and experiences."
  },
  {
    "id": 10,
    "topic": "Motivational Interviewing (MI)",
    "topic_data": "Motivation Interviewing (MI) is a form of therapy designed to help individuals move toward their goals by enhancing their intrinsic motivation. This is achieved in large part through resolving ambivalence. An adaptation of MI is Motivational Enhancement Therapy (MET). In both MI and MET, the therapist attempts to evoke talk of change to strengthen the individual’s commitment and minimize resistance. MI and MET have been shown to be useful for people struggling with addictions, alcohol-related problems, and other compulsive behaviors.  "
  },
  {
    "id": 11,
    "topic": "Brief Interventions",
    "topic_data": "An intervention is a carefully planned meeting designed to create a change in the subject of the intervention; usually concerning addiction or some other compulsive behaviour.  Addiction is very complicated; often people with addictions do not act like themselves.  They may have little insight into their illness and/or be in denial of the profound consequences of their behaviour.   They may feel overwhelmed by the desire to use, and so to cope they avoid acknowledging the consequences of the addiction.  The purpose of the intervention is to break through to the subject through constructive confrontation."
  },
  {
    "id": 12,
    "topic": "Psychoeducation",
    "topic_data": "Psychoeducation is designed to provide knowledge to individuals with mental health disorders and, in some cases, their families in order to promote rehabilitation. Psychoeducation is frequently delivered in groups and is typically brief.  Typically, sessions contain information about the illness, the proper course of therapy, and strategies for managing symptoms. Psychoeducation is frequently used in conjunction with other therapies. Psychoeducation has been shown to improve treatment adherence and decrease relapse and hospitalization rates in individuals with mental illness, such as bipolar disorder, schizophrenia, and those with comorbid mental illness and drug dependence. The psychoeducational group you attend may be led by a mental health professional, a peer counsellor with a similar diagnosis, or a community member. Certain forms of psychoeducational groups have distinct formats; however, some may be less regimented than others. The difference between psychoeducational groups and support group therapy is that in a psychoeducational group members are not expected to share personal stories or experiences.  Depending on the group that may be discouraged, although most groups will probably have a blend of both.  The focus is on education and not emotional support. Psychoeducation is an excellent option for people looking to get more information about a disorder and treatments in a group setting."
  },
  {
    "id": 13,
    "topic": "Problem-Solving Therapy (PST)",
    "topic_data": "The goal of problem-solving therapy (PST) is to enhance a person’s ability to cope with stressful aspects of life. PST is based on cognitive behavioural therapy (CBT) principles in that it views mental health problems as stemming from unhealthy coping mechanisms. PST has two major focuses, applying a positive problem-solving orientation to your life and using problem-solving skills to achieve better outcomes."
  },
  {
    "id": 14,
    "topic": "EAP (Employee Assistance Program) Counselling",
    "topic_data": "An employee assistance program (EAP) is a type of employee benefits program that provides services to employees who are experiencing personal and/or work-related problems. Employee assistance programs provide free counselling with a focus on problem-solving; especially difficulties that interfere with work. They also provide free and confidential examinations, referrals, and follow-up services to employees. EAPs do not dispense talk therapy in a long-term medical capacity, however, they are a good place to start finding other resources. Many people may be concerned about using an EAP out of fear that information may be shared with employers. However, in reality, there are strong privacy laws that protect against this. EAP counsellors may also serve in a consulting capacity with managers and supervisors to address employee and organizational difficulties. They also often provide conflict resolution. In any case, the employee is always in control of the experience and their information. Many businesses, academic institutions, and/or government agencies are actively involved in assisting organizations in preventing and coping with workplace violence, trauma, and other emergency response situations. Despite the fact that employee assistance programs (EAPs) are mostly focused on work-related concerns, there is a range of programs that can aid with problems that occur outside of the office. Attitudes toward mental health are changing and through EAPs employers are taking an active part in fostering good mental health. They also have a vested interest in harm prevention as mental health issues are some of the largest contributors to productivity loss. When it comes to mental health, early intervention leads to better results. Even though EAP programs do not represent a complete solution to mental health care; their accessibility, ease of use, and problem-solving-based approach make them an indispensable resource that should not be overlooked. Since their inception, employee assistance programs (EAPs) have expanded and risen in popularity; and are an excellent place to start the path to recovery.   You can check out our resources section under “Recommended Resources” to find resources made available by your organization."
  },
  {
    "id": 15,
    "topic": "Internet-based Cognitive Behavioral Therapy (iCBT)",
    "topic_data": "Internet-based cognitive behavioural therapy is an evidence-based form of CBT. Most programs include text, video, and audio files and are like face-to-face CBT in terms of content and duration of treatment. Most often ICBT includes some guidance from a therapist, although automated self-guided ICBT programs also exist. Studies suggest that guided ICBT is effective for treating anxiety, mood disorders, and obsessive-compulsive disorder (or OCD). ICBT is generally the more affordable option and can be practiced anywhere. If you are concerned about cost but you feel that it is important for you to have that guidance and support CBT is very well suited to be taught in a group therapy setting; both in-person and online. You can find out more information about CBT by clicking on the CBT treatment link in the therapy section of the treatment accordions, or the in-depth disorder section."
  },
  {
    "id": 16,
    "topic": "Mindfulness Based Cognitive Therapy (MBCT)",
    "topic_data": "Mindfulness-Based Cognitive Therapy (MBCT) was developed from Jon Kabat-Zinn’s mindfulness-based stress reduction program. MBCT is a group-based treatment that combines principles of cognitive behavioural therapy with meditative practices. Both practices complement each other and are therefore natural companions.  Mindfulness teaches the practice of detachment from worrying and focusing your mind, while CBT provides tools to critically examine and address negative thinking patterns.  MBCT was designed for people suffering from repeated bouts of depression and chronic unhappiness.  MBCT helps individuals better understand their depression, what causes their mood to spiral down, and how maintaining certain beliefs can contribute to depression. Research shows that MBCT helps reduce relapse rates in individuals with recurrent depression."
  },
  {
    "id": 17,
    "topic": "Meditation-Based Therapy",
    "topic_data": "Meditation therapy is a method of relaxation and consciousness expansion by focusing on a mantra or a keyword, sound, or image while eliminating outside stimuli from one’s awareness. There are many types of meditation. Examples include mindfulness, body scan, loving-kindness, walking, Zen, mantra, and transcendental meditations. They can be further categorized into insight or calming and guided or unguided. In the world of meditation, there is an approach for everyone. Each type of meditation has a few things in common: choosing a quiet spot, finding a comfortable posture, and focusing your attention while remaining open. The duration of meditation practice is as short as one minute to several hours. There also is no “right” or “only” way to practice. It is as diverse as the people who practice it."
  },
  {
    "id": 18,
    "topic": "Self-Help Groups",
    "topic_data": "Self-help groups are a type of group therapy that provide peer support. Typically, group therapy falls into three categories: psychoeducation, treatment-focused, and peer support. A peer support group is not focused on practicing or providing education on a specific treatment. They are a place where you will be welcomed and even expected to share your stories and experiences. These groups can provide empowerment, healing, sharing of resources, and help to reduce stigma. A self-help group is a type of support group that may provide additional assistance and action that would usually fall outside the scope of a talk therapy. This is known as mutual assistance. For example, self-help groups have been shown to be a successful method for poverty alleviation, human development, and social empowerment, and are thus frequently focused on microcredit programs and income-generating activities. "
  },
  {
    "id": 19,
    "topic": "Twelve-Step Facilitation",
    "topic_data": "Twelve-Step Programs or the 12-step facilitation system was originally developed by Alcoholics Anonymous. TSF programs are designed with the belief that people can help one another to achieve abstinence from drugs and alcohol. There is also a strong spiritual element to the program. A key component of this approach is accepting that one cannot overcome addiction without surrendering to a higher power. That higher power does not need to be a figure from an organized religion; participants are encouraged to find whatever works for them.  For people, who do not consider themselves religious or do not like this idea this may present a problem.  There are many secular alternatives to the TSF programs such as drug rehabilitation counselling, so it is wise to research any group or program about their values and practices before joining.  There are also organizations that offer an atheist version of AA; you can find more information here."
  },
  {
    "id": 20,
    "topic": "Attention Retraining",
    "topic_data": "We all know what it is to ‘pay attention’ and what it is to struggle to pay attention.  Who hasn’t found themselves daydreaming through a boring lecture or getting lost in a book? Even though the experience of exercising attention seems relatively simple, the science behind attention and the factors that underpin our attention spans are very complex.   Attention is a key cognitive ability that impacts the rest of our abilities because attention allows us to filter out information that isn’t important.  This has an effect on learning, problem-solving, memory and mood.  When our brains are primed to pay attention to negative stimuli; we filter out positive information which then colors our thoughts,  feelings and perceptions.  If you are filtering out positive information; you are bound to have a more negative outlook. There are many mental health issues and symptoms that can interfere with our ability to pay attention and impact what we pay attention to.  There are also brain differences that impact our attention, and these differences are understood to be the cause of ADHD. For a long time researchers believed that attention was fixed, but now we know that this is not true.  People with attention deficits can improve their attention through training, (with or without medication), and people with a negative attention bias can change low-level automatic biases through attentional retraining. Attentional retraining refers to the training of automatic attentional processes in order to improve a person’s ability to pay attention, and changes what they are primed to pay attention to.  The treatment was originally designed to help people recover from brain injuries;  however, it has been found to be effective in addressing attention challenges associated with ADHD, depression, anxiety and even addiction.   Typically attentional retraining is practiced with tasks facilitated by a computerized training program.  The tasks are very simple and they do not require learning; nor do they benefit from it.  For example, in a typical task a person would be presented with a screen displaying random numbers at either fixed or random intervals; and would be instructed to press a button every time they see a trigger stimuli, like an ‘X’. The aim is to improve the most basic forms of attention, and the neurological processes that underpin them. When you improve those basic abilities; the benefits generalize to other areas as well.   There are also variations of tasks that can train your brain to be less reactive to threatening and/or emotional stimuli.   Research has shown that people with anxiety have an attentional bias for threatening stimuli.  This makes sense; as when we are anxious we are actively looking for threats so we can avoid them.   Attentional retraining for anxiety uses modified versions of attention training tasks to combat the bias for negative or threatening information.  And in the same way that improving the ‘low-level’ attentional processing can generalize to improvements in more complex forms of attention; the same types of changes take place for anxiety.   Attentional retraining is a good option if you are struggling with attention issues or if you feel that you have an attentional bias toward negative information.  Talk to your doctor or mental health practitioner to find out more."
  },
  {
    "id": 21,
    "topic": "Behavioural Activation",
    "topic_data": "When we are depressed we find less pleasure in activities that we would normally enjoy.  This is one of the key symptoms of depression.  As a result we are less likely to seek out enjoyable things; and we miss out on the rewards that come from those activities.  Behavioural activation seeks to change this by pushing a patient to schedule those activities even if they do not feel like doing them. Behavioural activation emerged from ‘B' (or the behavioural component) of CBT.   CBT seeks to remedy mental health issues like depression, anxiety and mood disorders by training the patient to understand and then take advantage of the effects that thoughts, feelings and behaviours have on each other.  By changing one you can influence the other.  According to behavioural activation proponents; the most important of the three is behaviour, and by changing behaviour alone you can get good results.   The theory proposes that in people with depression their environments can contribute to their depression.  This can occur when the environment does not include enough rewards or too many punishments.  The goal of behavioural activation is to increase rewards and reduce punishments.  Most of us only have limited control of our environments, and nobody has total control.  The goal of behavioural activation is not to change the environment per se, but to identify how we engage with things in our environment when we are stressed.  Of particular importance to behavioural activation is the concept of a depression loop.  A depression loop forms when a coping method provides temporary relief but re-enforces depression in the long run.  For example, using drugs or alcohol to reduce anxiety only leads to more anxiety in the long run.  When a depression loop is identified the goal is to break up the loop by finding alternatives to the bad coping mechanisms.  This method is encapsulated with the acronym “TRAP” and “TRAC”, which stands for “Trigger”, “Response”, and “Avoidance Pattern” and “Trigger”, “Response”, and “Alternate Coping Mechanism”.  In Behavioral Activation, particular attention is given to controlling rumination.  Rumination is itself a short-term avoidance strategy.  When we are ruminating we are trying to think through a problem; which can help us avoid confronting the problem and facing the consequences.  Unfortunately, when we are ruminating we are wasting time that could be better spent on enjoyable activities.  Thus rumination has its own acronym, “RCA”, which stands for “Rumination”, “Cues”, and “ Action”.  To avoid rumination you identify the cues and then take action; instead of rumination.   There are other methods and techniques employed by behavioural activation practitioners but they all have the same aim.  To encourage the patient to have better interactions with their environments.  This philosophy is encapsulated in the acronym ACTION, which stands for: Assess behaviour/mood, Choose alternate responses, Try out those alternate responses, Integrate these alternatives, Observe results and Now evaluate.  Behavioural activation can be added to any therapy and is a good practice for improving mental wellness, even for people without any disorder or symptoms.   Many of the treatments that are practiced in behavioural activation also fit within CBT, so you may want to research CBT as well if behavioural activation interests you."
  },
  {
    "id": 22,
    "topic": "Cognitive Behavioural Therapy for Insomnia (CBT-I)",
    "topic_data": "Insomnia is a very common disorder with many possible causes; both psychological and physical.  It can also take many forms; including difficulty falling asleep, staying asleep or poor quality sleep in general.  It can be chronic or episodic; and it may be a symptom of other disorders such as depression, anxiety or bipolar disorder.  If you are experiencing insomnia you should talk to your doctor about it to rule out other causes which may themselves require treatment. Cognitive behavioural therapy for insomnia (or CBT-I) applies techniques from CBT alongside other practices to treat insomnia.  It has been shown to be effective in treating insomnia without resorting to sleep medication; which can lose effectiveness over time and be habit-forming. The goal of CBT-I is to improve sleep by identifying and changing the thoughts and behaviours that are impacting all aspects of sleep.  CBT is all about the connection between thoughts, behaviours and emotions; and CBT-I applies those insights to sleep disorders. The first step in treating insomnia with CBT-I is to identify the underlying issues that are resulting in insomnia.  For example, a person may be asked to keep a sleep journal for a few weeks. The journal documents sleep-related behaviours; and the thoughts and feelings that are interfering with sleep.  The goal is to find patterns and uncover factors that are contributing to the insomnia.  There may be specific triggers or unresolved issues that surface at night and keep us up. After identifying the issues; CBT-I recommends remedies to alleviate or adapt to the problems.  Some possible remedies include improving sleep hygiene, relaxation training; aromatherapy and cognitive training.  Sleep hygiene refers to behaviours you do during the day that can impact sleep.  For example avoid napping, only using your bed for sleep and sex, avoid work or strenuous activities before bed, and limit device usage before sleep. If you are having trouble limiting your devices use a blue light filter to filter out light frequencies that trick your brain into thinking it is daytime.  Many phones and computers have a “night mode” that changes the screen to limit the problematic light frequencies.  A CBT-I practitioner will help you with strategies to implement the changes as often it is hard to change your sleep habits all at once.  There are also cognitive therapies that can help relieve your mind before sleep.  Writing down things you worry about removes the burden of needing to remember them, and thus can reduce the anxiety associated with the problem.  Meditation and in particular mindfulness meditation can also help clear your mind of anxieties and put you in a more relaxed state which will encourage sleep.   Biofeedback is also an interesting option; as it helps you gain control of the stimulation level in your own body allowing you to lower it before sleep.  There is no one treatment method that is recommended over another and it may take some time to find out what works for you.  For some people one intervention is effective; other people may require multiple approaches. CBT-I has been demonstrated to be an effective treatment for insomnia, and the sleep problems associated with anxiety, depression, mood disorders and PTSD.  For episodic (or short-term) insomnia it can also be used in combination with sleep medication with the goal of reducing reliance and the possible dependence that can occur with long-term use."
  },
  {
    "id": 23,
    "topic": "Exposure-Based Therapies",
    "topic_data": "Exposure therapy is a psychological treatment that has been developed to help people cope with their fears. When people are afraid of something they tend to avoid the feared objects, activities or situations. While this avoidance helps reduce feelings of fear in the short term, in the long term it can make the fear worse.  When you avoid a situation you are implicitly reinforcing the belief that you are not able to handle the situation.  This in turn reduces your confidence in general.  In such situations, a psychologist may recommend an exposure therapy program to help break the pattern of fear and avoidance. With exposure therapy, psychologists create a safe environment in which they expose individuals to the things they fear and avoid. Exposure to feared objects, activities or situations in a safe environment reduces fear and decreases avoidance.  The therapist also offers guidance, support and encouragement; all the while disrupting the process that leads to decreased confidence. Exposure therapy has been shown to be a useful treatment for problems such as: "
  },
  {
    "id": 24,
    "topic": "Mindfulness Based Stress Reduction",
    "topic_data": "Mindfulness meditation is a form of meditation in which you focus your awareness on what you are feeling and sensing in the moment without interpretation or judgment. The practice of mindfulness involves deep breathing techniques, guided imagery and other practices to relax the body and mind with the goal of reducing stress, providing clarity and deep focus. Spending too much time planning, problem-solving, ruminating, or having negative thoughts, in general, can be mentally draining. It can also make you more likely to experience stress, anxiety and symptoms of depression. Practicing mindfulness exercises can help you turn your attention away from these types of thoughts and engage with the world around you. By engaging more deeply with your present surroundings you are able to ‘get out of your own head’."
  },
  {
    "id": 25,
    "topic": "Addiction Counseling",
    "topic_data": "The American Psychological Association defines addiction as “an uncontrolled use of a substance despite harmful consequences. People with SUD have an intense focus on using a certain substance(s) such as alcohol, tobacco, or illicit drugs, to the point where the person’s ability to function in day to day life becomes impaired.” Addiction, or substance abuse disorder, is a complex disorder with physical, mental, social and economic dimensions.  Once thought of as lack of willpower we now understand that addiction is not about willpower or discipline.  In fact many people with addictions are very high functioning and display great amounts of discipline in other areas of life.  Addiction is unique among mental health disorders as there are many variables at play such as the substance of abuse, comorbid disorders, and the level of functioning of the person suffering from the illness. Often people with addiction have other underlying disorders and use drugs and/or alcohol to ‘self-medicate’. Addictions counseling is an umbrella term that refers to many different types of addiction focused treatments.  It is a type of behavioural therapy that aims to address the causes of addiction and teach strategies to cope with the consequences and avoid relapse. Counselors provide support and try to find services and solutions to issues surrounding addiction such as difficulties with employment and/or housing. Not all addictions counselors are trained therapists, many in fact start as peer-support counselors; and may have personal knowledge of substance abuse themselves.  It is a good idea to ask about background and talk to a few people before committing to counseling. Just as there is no one way one becomes and stays an addict; there is no one therapy that will work for everyone. Addiction counselors receive special training on addiction and take a holistic approach to manage the illness In general there are four ways addictions counseling is delivered.  Individual, group, family counseling and online.  Each one has its own advantages and disadvantages.  Individual counseling is best for people who value their privacy.  It is also best for people with specific goals who are looking for individual attention.  Group counseling is good for people who are motivated by being part of group or team and are looking for budget-friendly options.  However with group counseling you should not expect the same level of attention as individual counseling.  Family counseling is best in situations where problems in the family dynamic are contributing to the addiction; or for younger people or people who still live at home.  Online counseling is best for people who want options who may not have resources in their area or are looking for individual attention at a lower price.  With the opiod epidemic the health care system is strained; and more and more people are turning to addiction counselors to help them navigate the health care system.    People who engage with addictions counseling and other therapies have better outcomes and lower relapse rates than those who engage with therapy alone."
  },
  {
    "id": 26,
    "topic": "Cognitive Remediation Therapy",
    "topic_data": "Cognitive remediation is a psychosocial therapeutic intervention that aims to treat cognitive disorders. This technique is specifically designed for therapeutic use to restore, strengthen, and compensate for altered or impaired cognitive abilities. It aims to indirectly contribute to improving patients' autonomy and socio-professional functioning by improving cognitive functioning where possible; and providing adaptive techniques, tools and technologies to reduce the impact of remaining deficits. Cognitive remediation is comprised of specific exercises designed to train (or re-train) the brain to reduce functional deficiencies; or provide reinforcement of preserved functions through a compensation mechanism."
  }
]
